import page
import time
from base.base import Base


class PageOutManage(Base):
    """
        出库管理→报废单管理→我的报废单新增
    """
    # 点击出库管理

    # 点击报废单管理

    # 点击我的报废单

    # 点击新增

    # 输入报废单名称

    # 点击类型

    # 选择类型

    # 输入申请理由

    # 点击添加备件清单

    # 点击选择备件型号icon

    # 点击选择备件型号radio

    # 点击确定

    # 输入备件数量

    # 点击保存

    # 点击待审批报废单

    # 输入报废单名称

    # 点击状态

    # 选择状态

    # 点击查询

    # 点击审批

    # 输入审批意见

    # 点击通过

    # 点击报废管理

    # 点击新增

    # 输入报废单名称

    # 点击类型

    # 选择类型

    # 输入申请理由

    # 点击添加备件清单

    # 点击选择备件型号icon

    # 点击选择备件型号radio

    # 点击确定

    # 输入备件数量

    # 点击保存